By all respect - I do not see the need for an ordering... 

```hcl
provider "aws" {
  max_retries = 1337
  region      = "eu-central-1"
  profile     = "devops"
}

data "aws_route53_zone" "zone" {
  name         = "test.dev.reservix.cloud."
  private_zone = false
}

locals {
  domain = trimsuffix(data.aws_route53_zone.zone.name, ".")
  subject_alternative_names = flatten([
    for subdomain in [
      "one",
      "two",
      "three",
      "four",
      "fife",
      "six",
      "seven",
      "eight",
      "nine"
    ] : format("%s.%s", subdomain, local.domain)
  ])
}

resource "aws_acm_certificate" "cert" {
  domain_name       = data.aws_route53_zone.zone.name
  validation_method = "DNS"

  subject_alternative_names = local.subject_alternative_names
}

resource "aws_route53_record" "cert_validation" {
  for_each = { for n in flatten([local.domain, local.subject_alternative_names]) : n => n }

  name = [for domain_validation_options in aws_acm_certificate.cert.domain_validation_options :
    domain_validation_options.resource_record_name if domain_validation_options.domain_name == each.value
  ][0]
  type = [for domain_validation_options in aws_acm_certificate.cert.domain_validation_options :
    domain_validation_options.resource_record_type if domain_validation_options.domain_name == each.value
  ][0]
  records = [for domain_validation_options in aws_acm_certificate.cert.domain_validation_options :
    domain_validation_options.resource_record_value if domain_validation_options.domain_name == each.value
  ]
  zone_id = data.aws_route53_zone.zone.id
  ttl     = 60
}

resource "aws_acm_certificate_validation" "cert" {
  certificate_arn = aws_acm_certificate.cert.arn
  validation_record_fqdns = [
    for cert_validation in aws_route53_record.cert_validation :
    cert_validation.fqdn
  ]
}
```

```console
19:25 n3ph@mag-xps ~/tmp ✔  tf apply
data.aws_route53_zone.zone: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "test.dev.reservix.cloud"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "eight.test.dev.reservix.cloud",
          + "fife.test.dev.reservix.cloud",
          + "four.test.dev.reservix.cloud",
          + "nine.test.dev.reservix.cloud",
          + "one.test.dev.reservix.cloud",
          + "seven.test.dev.reservix.cloud",
          + "six.test.dev.reservix.cloud",
          + "three.test.dev.reservix.cloud",
          + "two.test.dev.reservix.cloud",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["four.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["one.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["six.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["three.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

  # aws_route53_record.cert_validation["two.test.dev.reservix.cloud"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z28B3YX20SREXV"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_acm_certificate.cert: Creating...
aws_acm_certificate.cert: Still creating... [10s elapsed]
aws_acm_certificate.cert: Still creating... [20s elapsed]
aws_acm_certificate.cert: Creation complete after 20s [id=arn:aws:acm:eu-central-1:159388291991:certificate/003a08ce-9c40-400f-b765-3c56daa6e5d7]
aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["four.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["two.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["test.dev.reservix.cloud"]: Creating...
aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["four.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["two.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Still creating... [10s elapsed]
aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["four.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["two.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Still creating... [20s elapsed]
aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["four.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["two.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Still creating... [30s elapsed]
aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"]: Creation complete after 37s [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["two.test.dev.reservix.cloud"]: Creation complete after 39s [id=Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["four.test.dev.reservix.cloud"]: Creation complete after 39s [id=Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["test.dev.reservix.cloud"]: Creation complete after 39s [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"]: Creation complete after 40s [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Still creating... [40s elapsed]
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Still creating... [40s elapsed]
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Still creating... [40s elapsed]
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Still creating... [40s elapsed]
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Still creating... [40s elapsed]
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Creation complete after 40s [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Creation complete after 41s [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Creation complete after 41s [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Creation complete after 41s [id=Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Creation complete after 41s [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME]
aws_acm_certificate_validation.cert: Creating...
aws_acm_certificate_validation.cert: Still creating... [10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [30s elapsed]
aws_acm_certificate_validation.cert: Still creating... [40s elapsed]
aws_acm_certificate_validation.cert: Still creating... [50s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m0s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m30s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m40s elapsed]
aws_acm_certificate_validation.cert: Still creating... [1m50s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m0s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m30s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m40s elapsed]
aws_acm_certificate_validation.cert: Still creating... [2m50s elapsed]
aws_acm_certificate_validation.cert: Still creating... [3m0s elapsed]
aws_acm_certificate_validation.cert: Still creating... [3m10s elapsed]
aws_acm_certificate_validation.cert: Still creating... [3m20s elapsed]
aws_acm_certificate_validation.cert: Still creating... [3m30s elapsed]
aws_acm_certificate_validation.cert: Still creating... [3m40s elapsed]
aws_acm_certificate_validation.cert: Creation complete after 3m46s [id=2019-12-15 18:31:22 +0000 UTC]

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
19:31 n3ph@mag-xps ~/tmp ✔  tf apply
data.aws_route53_zone.zone: Refreshing state...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-central-1:159388291991:certificate/003a08ce-9c40-400f-b765-3c56daa6e5d7]
aws_route53_record.cert_validation["seven.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__a99a6433d8441811df0cf59bbfcb9331.seven.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__5f73fbc90b619a65895a4dffbacddfd7.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["nine.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__d0b6b365ab587df1952c2df1e1087314.nine.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["four.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__5c90a857aeb3c49005725446e3000e9b.four.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["eight.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__38cf8495690716eece0b96323571cf65.eight.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["one.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__ecb6ce42d1ef425e027d56f896892a42.one.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["two.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__bcb7a37d8016410f717e3861d880b246.two.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["three.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__3f1ed51a71c6868705bbfcfd312025ff.three.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["six.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__189e80929f9fb54bb310bc70a00929b7.six.test.dev.reservix.cloud._CNAME]
aws_route53_record.cert_validation["fife.test.dev.reservix.cloud"]: Refreshing state... [id=Z28B3YX20SREXV__95d3634f83e0657d8a6468e04e7fb092.fife.test.dev.reservix.cloud._CNAME]
aws_acm_certificate_validation.cert: Refreshing state... [id=2019-12-15 18:31:22 +0000 UTC]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
19:34 n3ph@mag-xps ~/tmp ✔  
```

